In [1]:
import pandas as pd

In [2]:
s1 = pd.Series(['A','B','C'])
s2 = pd.Series([1,2,3])
display(s1,s2)

0    A
1    B
2    C
dtype: object

0    1
1    2
2    3
dtype: int64

In [3]:
print('After concating :')
pd.concat([s1,s2])

After concating :

0    A
1    B
2    C
0    1
1    2
2    3
dtype: object

In [5]:
# problem 2, with axis=1

In [7]:
pd.concat([s1,s2],axis=1)

   0  1
0  A  1
1  B  2
2  C  3

In [8]:
# Concating 2 dataframes with keys

In [9]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})
display('df1 :',df1)

'df1 :'

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [10]:
df2 = pd.DataFrame({'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})
display('df2 :',df2)

'df2 :'

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [12]:
# Now 
pd.concat([df1,df2])

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [15]:
# on the basis of key
pd.concat([df1,df2],keys=['key1','key2'])

          A    B    C    D
key1 0   A0   B0  NaN  NaN
     1   A1   B1  NaN  NaN
     2   A2   B2  NaN  NaN
     3   A3   B3  NaN  NaN
key2 0  NaN  NaN   C0   D0
     1  NaN  NaN   C1   D1
     2  NaN  NaN   C2   D2
     3  NaN  NaN   C3   D3

In [17]:
df3 = pd.DataFrame({'A':['A11','A12','A13','A14'],
                'B':['B11','B12','B13','B14']})

In [19]:
pd.concat([df1,df3],keys=['key1','key2'])

          A    B
key1 0   A0   B0
     1   A1   B1
     2   A2   B2
     3   A3   B3
key2 0  A11  B11
     1  A12  B12
     2  A13  B13
     3  A14  B14

In [20]:
pd.concat([df1,df3])

     A    B
0   A0   B0
1   A1   B1
2   A2   B2
3   A3   B3
0  A11  B11
1  A12  B12
2  A13  B13
3  A14  B14

In [21]:
# Concatenating 2 DataFrames horizontally with axis = 1.

In [22]:
pd.concat([df1,df2],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [23]:
# Concatenating 2 DataFrames with ignore_index = True so that new index values are displayed in the concatenated DataFrame.

In [24]:
pd.concat([df1,df3],ignore_index=True)

     A    B
0   A0   B0
1   A1   B1
2   A2   B2
3   A3   B3
4  A11  B11
5  A12  B12
6  A13  B13
7  A14  B14

In [25]:
# Concatenating a DataFrame with a Series.

In [26]:
pd.concat([df1,s1])

     A    B    0
0   A0   B0  NaN
1   A1   B1  NaN
2   A2   B2  NaN
3   A3   B3  NaN
0  NaN  NaN    A
1  NaN  NaN    B
2  NaN  NaN    C

In [27]:
pd.concat([df1,s1],axis=1)

    A   B    0
0  A0  B0    A
1  A1  B1    B
2  A2  B2    C
3  A3  B3  NaN